# GetItemFiles Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationItemFolder..::..GetItemFiles Method
FabricationItemFolder Class See Also
---
Gets the item files in this item folder.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public IList<FabricationItemFile> GetItemFiles()
```

Visual Basic
---
```text
Public Function GetItemFiles As IList(Of FabricationItemFile)
```

Visual C++
---
```text
public:
IList<FabricationItemFile^>^ GetItemFiles()
```

# See Also
FabricationItemFolder Class
Autodesk.Revit.DB Namespace